In [1]:
import sqlite3

# Create a SQL connection to our SQLite database
con = sqlite3.connect("Northwind_large.sqlite")

In [45]:
available_table

[('Category',),
 ('Customer',),
 ('CustomerCustomerDemo',),
 ('CustomerDemographic',),
 ('Employee',),
 ('EmployeeTerritory',),
 ('Order',),
 ('OrderDetail',),
 ('Product',),
 ('Region',),
 ('Shipper',),
 ('Supplier',),
 ('Territory',)]

In [41]:
import sqlite3

# Create a SQL connection to our SQLite database
con = sqlite3.connect("data/portal_mammals.sqlite")

cur = con.cursor()

# Return all results of query
cur.execute('SELECT plot_id FROM plots WHERE plot_type="Control"')
cur.fetchall()

# Return first result of query
cur.execute('SELECT species FROM species WHERE taxa="Bird"')
cur.fetchone()

# Be sure to close the connection
con.close()

OperationalError: unable to open database file

In [51]:
cur = con.cursor()

# The result of a "cursor.execute" can be iterated over by row
cur.execute('SELECT * FROM Order;')
cur.fetchall()

OperationalError: near "Order": syntax error

In [5]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;")
available_table=(cur.fetchall())

In [13]:
#excercise 2

cur.execute('SELECT CategoryName, Description FROM Category;')
cur.fetchall()

[('Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 ('Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 ('Confections', 'Desserts, candies, and sweet breads'),
 ('Dairy Products', 'Cheeses'),
 ('Grains/Cereals', 'Breads, crackers, pasta, and cereal'),
 ('Meat/Poultry', 'Prepared meats'),
 ('Produce', 'Dried fruit and bean curd'),
 ('Seafood', 'Seaweed and fish')]

In [25]:
#excercise 3
import pandas as pd
Q = 'SELECT FirstName, LastName, HireDate from Employee where title = "Sales Representative" and country = "USA";'
pd.read_sql( Q , con)

  FirstName   LastName    HireDate
0     Nancy    Davolio  2024-05-01
1     Janet  Leverling  2024-04-01
2  Margaret    Peacock  2025-05-03

In [27]:
#excercise 4
Q = 'SELECT OrderID, OrderDate from Order where EmployeeID = 5;'
pd.read_sql( Q , con)

DatabaseError: Execution failed on sql 'SELECT OrderID, OrderDate from Order where EmployeeID = 5;': near "Order": syntax error

In [59]:
#excercise 5
Q = 'SELECT Id, OrderDate FROM "Order" where EmployeeId = 5'
pd.read_sql( Q , con)

         Id            OrderDate
0     10248           2012-07-04
1     10254           2012-07-11
2     10269           2012-07-31
3     10297           2012-09-04
4     10320           2012-10-03
...     ...                  ...
1854  27047  2015-02-12 23:01:30
1855  27048  2015-08-15 13:14:24
1856  27053  2015-03-11 05:01:22
1857  27061  2013-06-29 21:05:55
1858  27063  2014-10-15 09:51:09

[1859 rows x 2 columns]